'''1. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს 
      სტრიქონის UTF-8 დაშიფრულ ვერსიას.'''

#დავალება N1

text = input("შეიყვანეთ სტრიქონი: ")

text = text.encode()

print(f"თქვენს მიერ შეყვანილი სტრიქონის დაშიფრული ვერსია: {text}")


'''2. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.
      ჩამოაშორეთ ზედმეტი ინტერვალები.
      ყველა სიმბოლო გადაიყვანეთ პატარა ასოებში და
      დაუმატეთ ქვესტრიქონი 'Python'.
      თუ შეყვანილ სტრიქონში არსებობს სიტყვა "python", ჩაანაცვლეთ "Python"-ით.

      მინიშნება: ზედმეტი ინტერვალების ჩამოსაშორებელი მეთოდია `.strip()`.

      მაგ.: "  Python is funny     ".strip()   ====>  "Python is funny"'''

#დავალება N2

text = input("შეიყვანეთ ტექსტი: ")

text = text.strip()
text = text.lower()
text = text + "\nPython"
text = text.replace("python", "Python")

print(text)


'''3. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.
      პროგრამამ უნდა დააბრუნოს ახალი სტრიქონი,
      რომელიც შედგება შეყვანილი სტრიქონის პირველი ნახევრისაგან.'''

#დავალება N3

text = input("შეიყვანეთ ტექსტი: ")

print(f"შეყვანული სტრიქონის პირველი ნახევარია: {text[0:(len(text)//2)]}")


'''4. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.
      string მოდულის გამოყენებით დაწერეთ შემოწმება.
      სტრიქონი ვალიდურია მაშინ, როდესაც ის შეიცავს მინიმუმ ერთ ლათინურ ასოსა და მინიმუმ 
      ერთ ციფრს და ამავე დროს არ შეიცავს დამატებით სიმბოლოებს: '!', '~', '#', '$' და ა.შ.'''

#დავალება N4

import string

text = input("შეიყვანეთ ტექსტი: ")

letter = 0
digit = 0
symbol = 0

for i in text:
    if i in string.ascii_letters:
        letter += 1
    elif i in string.digits:
        digit += 1
    elif i in string.punctuation:
        print("შეყვანილი ტექსტი არავალიდურია")
        exit()
    
if letter > 0  and digit > 0:
    print("შეყვანილი ტექსტი ვალიდურია")
else:
    print("შეყვანილი ტექსტი არავალიდურია") 

'''5. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს,
      სტრიქონი გადაყავს ბაიტებში, ბეჭდავს მნიშვნელობას და შემდეგ კი
      გადაყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს. '''

#დავალება N5

text = input("შეიყვანეთ ტექსტი: ")

text = text.encode()
print(f"თქვენს მიერ შეყვანილი სტრიქონის დაშიფრული ვერსია: {text}")

text = text.decode()
print(f"თქვენს მიერ შეყვანილი სტრიქონის დაუშიფრავი ვერსია: {text}")