'''1. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და 
      ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.'''

#დავალება N1

n = int(input("შეიყვანეთ რიცხვი: "))
sum = 0
for i in range(n):
    sum += i

print(f"1-დან {n}-მდე რიცხვების ჯამია {sum}")


'''2. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ 
      იყენებს "while" ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე.
      მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1'''

#დავალება N2

num = int(input("შეიყვანეთ რიცხვი: "))

while num > 0:
    print(num, end=" ")
    num -=1

'''3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს 
      გამოიცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ 
      რიცხვს, დაასრულებს პროგრამა მუშაობას.'''

#დავალება N3

from random import randint

X = randint(1,100)

while True:
    num = int(input("შეიყვანეთ რიცხვი: "))

    if X == num:
        print(f"თქვენ გამოიცანით ჩაფიქრებული რიცხვი {X}\n")
        break
    elif X > num:
        print(f"ჩაფიქრებული რიცხვი მეტია {num}-ზე\n")
    else:
        print(f"ჩაფიქრებული რიცხვი ნაკლებია {num}-ზე\n")

'''4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი 
      ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ 
      total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 
      'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.'''

#დავალება N4

total_sum = 0

while True:
    x = input("შეიყვანეთ რიცხვი: ")

    if x == "sum":
        print(f"თქვენს მიერ შეყვანილი დადებითი რიცხვების ჯამია {total_sum}")
        break
    elif int(x) > 0:
        total_sum +=int(x)
    else:
        continue