
#საშინაო დავალება N1

a = int(input("შეიყვანეთ პირველი რიცხვი: "))
b = int(input("შეიყვანეთ მეორე რიცხვი: "))


print(f"a + b = {a + b}")
print(f"a - b = {a - b}")
print(f"a * b = {a * b}")
print(f"a / b = {a / b}")
print(f"a // b = {a // b}")
print(f"a % b = {a % b}")
print(f"a ** b = {a ** b}")

#საშინაო დავალება N2

x = float(input("შეიყვანეთ პირველი დიაგონალის სიგრძე: "))
y = float(input("შეიყვანეთ მეორე დიაგონალის სიგრძე: "))

print(f"რომბის ფართობი რომელის დიაგონალები არის {x} და {y} ტოლია: {x*y/2}")

#საშინაო დავალება N3

x = float(input("შეიყვანეთ მეტრების რაოდენობა: "))

print(f"{x} მეტრი არის {x*100} სანტიმეტრი")
print(f"{x} მეტრი არის {x*10} დეციმეტრი")
print(f"{x} მეტრი არის {x*100*10} მილიმეტრი")
print(f"{x} მეტრი არის {x*0.000621371} მილი")

#საშინაო დავალება N4

h = float(input("შეიყვანეთ სამკუთხედის სიმაღლე: "))
a = float(input("შეიყვანეთ სამკუთხედის ფუძე: "))

print(f"საამკუთხედის ფართობი რომლის სიმაღლეა {h} და ფუძეა {a} ტოლია: {a*h/2}")


#საშინაო დავალება N5

x = int(input("შეიყვანეთ ორნიშნა რიცხვი: "))

print(f"შეყვანილი {x} ორნიშნა რიცხვის ციფრთა ჯამია: {x // 10 + x % 10}")