'''1. შექმენით პითონის კლასი Car, ატრიბუტებით: ბრენდი, მოდელი და წელი. ასევე, შექმენით კლასის მეთოდი car_info(), 
    რომელიც დაბეჭდავს ატრიბუტების ინფორმაციას.

2. Car კლასში დაამატეთ მეთოდი age_of_car, რომელიც დაითვლის მანქანის ასაკს. ავტომობილის ასაკი დაბეჭდეთ car_info() მეთოდიდან.

3. შექმენით კლასი ElectricCar, რომელიც მემკვიდრეობით მიიღებს Car კლასს. დაამატეთ ახალი ატრიბუტი battery_life და 
    მეთოდი battery_info(), რომელიც დაბეჭდავს შემდეგ სტრიქონს "ამ მანქანის ბატარეის ხანგრძლივობა არის [battery_life] საათი".

4. დაამატეთ Car კლასს ატრიბუტი number_of_cars, რომელიც დაითვლის მანქანების სრულ რაოდენობას. 
    გაზარდეთ ეს ცვლადი ყოველ ჯერზე, მანქანის შექმნისას. 

5. Car კლასს დაამატეთ მეთოდი total_cars(), რომელიც გამოიტანს მანქანების მთლიან რაოდენობას.'''

from hw_16 import Car, ElectricCar

#N1. დავალება
car1 = Car("Ford", "Mustang", 1969)
car2 = Car("Mercedes-Benz", "E-Class", 2021)

#N2. დავალება  
el_car1 = ElectricCar("Tesla", "Model S", 2024, 100)
    
#3. დავალება
car1.car_info()
car2.car_info()

#N4. დავალება
el_car1.car_info() 
el_car1.battery_info()
    
#N5. დავალება    
Car.total_cars()
   
    
