'''1. დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად n, და 
    გამოიტანს ფიბონაჩის n რაოდენობის მიმდევრობას.'''
#დავალება N1

n  = int(input("შეიყვანეთ ფიბონაჩის მიმდევრობის წევრების რაოდენობა: "))

def fibonaci(n):
    
    a, b = 0, 1

    for _ in range(n):

        print(a, end=" ")
        
        a, b = b, a + b

fibonaci(n)


'''
2. დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად ორ სტრიქონს 
    და შეამოწმებს არის თუ არა სტრიქონები ანაგრამები (ანაგრამი არის სიტყვა 
    ან შესიტყვება, რომელიც წარმოიქმნება სხვა სიტყვის ან შესიტყვების ასოების გადაადგილებით). 
    მაგ.: race და care ანაგრამებია.'''

#დავალება N2

word1 = input("შეიყვანეთ პირველი სტრიქონი: ")

word2 = input("შეიყვანეთ მეორე სტრიქონი: ")


def anagram(word1, word2):
    
    word1 = word1.replace(" ", "")

    word2 = word2.replace(" ", "")
    
    if len(word1) == len(word2) and sorted(word1) == sorted(word2):
        return "ანაგრამებია"
    else:
        return "არ არის ანაგრამები"

print(anagram(word1, word2))

'''
3. დაწერეთ პითონის ფუნქცია რომელიც მიიღებს n რიცხვს და დააბრუნებს მის ფაქტორიალს.
'''
#დავალება N3

n = int(input("შეიყვანეთ დადებითი რიცხვი: "))

def factorial(n):

    if n == 0:
        return 1
    else:
        return n * factorial(n-1)

print(factorial(n))
    

'''
4. დაწერეთ პითნის ფუნქცია რომელიც მიიღებს  ორ პარამეტრს, პირველს სტრიქონს და 
    მეორეს სიმბოლოს. ფუნქციამ უნდა მოძებნოს სტრიქონში რამდენჯერ მეორდება 
    პარამეტრად მიღებული სიმბოლო და დააბრუნოს  მისი რაოდენობა.'''

#დავალება N4

sentence = input("შეიყვანეთ სტრიქონი: ")

symbol = input("შეიყვანეთ სიმბოლო: ")

def count(sentence, symbol):

    return sentence.count(symbol)

print(count(sentence, symbol))