'''1. დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), 
    თუ მომხარებელი შეიყვანს სიმბოლო 'a'-ს, ნიშნავს რომ უნდა დაამატოთ სიაში რიცხვი; 
    თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი; 'e'-ს შეტანისას პროგრამამ უნდა 
    დაასრულოს მუშაობა. მიღებული შედეგი დაბეჭდეთ კონსოლში.'''

#დავალება N1
from random import randint

sia = []

while True:

    task = input("შეიყვანეთ ბრძანების სიმბოლო a/r/e: ")

    if task == "a":
        sia.append(randint(1,100))
        print(sia)
    elif task == "r" and len(sia) > 0:
        sia.remove(sia[randint(0,len(sia)-1)])
        print(sia)
    elif task == "e":
        print(sia)
        exit()
    else:
        print("შეყვანილი ბრძანება არასწორია")
        continue

''' 2. დაწერეთ პითონის პროგრამა, რომელიც შექმნის სიას 
       my_list_1 = [43, '22', 12, 66, 210, ["hi"]], და შეასრულებს შემდეგ ნაბიჯებს:

       a. დაბეჭდავს 210-ის ინდექსს;
 
       b. დაამატებს ბოლო ელემენტში ტექსტს "hello";

       c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას;

       d. შექმენით ახალი სია my_llist_2, რომელსაც ექნება my_llist_1-ის მნიშვნელობა, 
       გაასუფთავეთ my_llist_2-ის მნიშნველობა და დაბეჭდეთ ორივე სია.

       მინიშნება: სიის გასუფთავება - arr.clear()'''

#დავალება N2

my_list_1 = [43, '22', 12, 66, 210, ["hi"]]

print(f" 210 ინდექსი არის: {my_list_1.index(210)}")

my_list_1[len(my_list_1)-1].append("hello")

print(f"ბოლო ელემენტში დაემატება ტექსტი hello,- {my_list_1}")

my_list_1.remove(my_list_1[2])

print(f"მეორე ინდექსის მქონე ელემენტის წაშლა: {my_list_1}")

my_list_2 = my_list_1.copy()

my_list_2.clear()

print(my_list_1, my_list_2)

'''3. დაწერეთ პითნის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და regex-ით 
      შეამოწმებს შეყვანილი ნომერი იცავს თუ არა "(123) 456-789" ფორმატს, თუ იცავს 
      დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, წინააღმდეგ შემთხვევაში 
      გამოიტანეთ "Invalid format" ტექსტი.

      მინიშნება: სრული დამთხვევისთვის გამოიყენეთ .fullmatch() მეთოდი re მოდულიდან.'''

#დავალება N3

import re


Tel_number = input("შეიყვანეთ ტელეფონის ნომერი: ")

if re.fullmatch(r"\(\d{3}\)\s\d{3}-\d{3}",Tel_number):
    print(f"შეყვანილი ტელეფონის ნომერია: {Tel_number}")
else:
    print("Invalid format")